    [
    {
        "category": "formal",
        "question": "How would you introduce yourself in a professional context?"
    },
    {
        "category": "formal",
        "question": "Write a polite message to request more details about a task or project."
    },
    {
        "category": "formal",
        "question": "How would you summarize an update about your work or activities?"
    },
    {
        "category": "formal",
        "question": "Write a message to confirm a scheduled meeting or appointment."
    },
    {
        "category": "formal",
        "question": "How would you notify someone about a completed task in a formal way?"
    },
    {
        "category": "formal",
        "question": "Write a polite reminder about an upcoming deadline."
    },
    {
        "category": "formal",
        "question": "How would you acknowledge someone’s contribution to a project or task?"
    },
    {
        "category": "formal",
        "question": "Write a message to apologize for a minor delay in delivering a task."
    },
    {
        "category": "formal",
        "question": "How would you respond formally to a question asking for clarification?"
    },
    {
        "category": "formal",
        "question": "Write a message to politely suggest an alternative plan for a meeting or project."
    },
    {
        "category": "formal",
        "question": "How would you propose an idea to improve a process or task?"
    },
    {
        "category": "formal",
        "question": "Write a formal note to express gratitude for someone’s guidance."
    },
    {
        "category": "formal",
        "question": "How would you ask for permission to take on a new responsibility or task?"
    },
    {
        "category": "formal",
        "question": "Write a brief, polite response to a formal inquiry."
    },
    {
        "category": "formal",
        "question": "How would you describe your progress on a shared task in a professional manner?"
    },
    {
        "category": "formal",
        "question": "Write a message to formally congratulate someone on their success."
    },
    {
        "category": "formal",
        "question": "How would you communicate a change in plans to a client or superior?"
    },
    {
        "category": "formal",
        "question": "Write a polite follow-up message after an earlier conversation or meeting."
    },
    {
        "category": "formal",
        "question": "How would you decline an offer or request while maintaining a formal tone?"
    },
    {
        "category": "formal",
        "question": "Write a message to politely introduce yourself to a new team member or colleague."
    },
    {
        "category": "neutral",
        "question": "How would you introduce yourself to a new teammate in your group?"
    },
    {
        "category": "neutral",
        "question": "Write a message to check in on the progress of a shared task."
    },
    {
        "category": "neutral",
        "question": "How would you share a quick update about your work with your team?"
    },
    {
        "category": "neutral",
        "question": "Write a note to ask a colleague for help on a task or project."
    },
    {
        "category": "neutral",
        "question": "How would you explain a minor challenge you faced while working on a project?"
    },
    {
        "category": "neutral",
        "question": "Write a polite request to adjust the time of a meeting or event."
    },
    {
        "category": "neutral",
        "question": "How would you confirm your attendance at a team meeting or activity?"
    },
    {
        "category": "neutral",
        "question": "Write a message to notify your team about completing a small task."
    },
    {
        "category": "neutral",
        "question": "How would you thank a colleague who helped you solve a problem?"
    },
    {
        "category": "neutral",
        "question": "Write a message to remind a teammate about their role in a project."
    },
    {
        "category": "neutral",
        "question": "How would you describe your priorities for the week to your team?"
    },
    {
        "category": "neutral",
        "question": "Write a short note to suggest a minor improvement to a shared task."
    },
    {
        "category": "neutral",
        "question": "How would you update a teammate about a change in project details?"
    },
    {
        "category": "neutral",
        "question": "Write a message to ask for feedback on something you’ve been working on."
    },
    {
        "category": "neutral",
        "question": "How would you politely disagree with a suggestion in a team discussion?"
    },
    {
        "category": "neutral",
        "question": "Write a short note to check in on a colleague who hasn’t been active recently."
    },
    {
        "category": "neutral",
        "question": "How would you inform a teammate about a delay in completing a task?"
    },
    {
        "category": "neutral",
        "question": "Write a message to suggest celebrating a milestone with your team."
    },
    {
        "category": "neutral",
        "question": "How would you casually propose a new idea during a team meeting?"
    },
    {
        "category": "neutral",
        "question": "Write a note to confirm that you’ve received and understood instructions from a teammate."
    },
    {
        "category": "informal",
        "question": "How would you describe your day to a friend in a casual text?"
    },
    {
        "category": "informal",
        "question": "Write a message inviting a friend to hang out this weekend."
    },
    {
        "category": "informal",
        "question": "How would you apologize to a friend for being late to a meetup?"
    },
    {
        "category": "informal",
        "question": "Write a casual note to ask a friend for advice on something personal."
    },
    {
        "category": "informal",
        "question": "How would you share exciting news about your life with a close friend?"
    },
    {
        "category": "informal",
        "question": "Write a message to check in on a friend you haven’t spoken to in a while."
    },
    {
        "category": "informal",
        "question": "How would you remind a friend about something they promised to do for you?"
    },
    {
        "category": "informal",
        "question": "Write a short text to suggest meeting up for coffee or a casual outing."
    },
    {
        "category": "informal",
        "question": "How would you share a funny or awkward story from your day with a friend?"
    },
    {
        "category": "informal",
        "question": "Write a message to plan a road trip or activity with your friends."
    },
    {
        "category": "informal",
        "question": "How would you casually thank a friend for helping you out with something?"
    },
    {
        "category": "informal",
        "question": "Write a playful message to start a conversation with a friend."
    },
    {
        "category": "informal",
        "question": "How would you suggest a movie or show to a friend in a casual tone?"
    },
    {
        "category": "informal",
        "question": "Write a short text to check if your friend is free to chat or hang out."
    },
    {
        "category": "informal",
        "question": "How would you let a friend know you’re running late in a casual way?"
    },
    {
        "category": "informal",
        "question": "Write a lighthearted message to cheer up a friend who’s feeling down."
    },
    {
        "category": "informal",
        "question": "How would you suggest plans for the weekend to your group of friends?"
    },
    {
        "category": "informal",
        "question": "Write a quick note to casually ask a friend for their opinion on something."
    },
    {
        "category": "informal",
        "question": "How would you casually describe an awkward or funny encounter you had?"
    },
    {
        "category": "informal",
        "question": "Write a short text to tell a friend you’re thinking about them."
    }
]